import React from 'react'
import Header from '../components/Header'
import './surah.scss'

const Surah = () => {
  return (
    <>
        <Header back home lang />
        <div className="cards">
            <h4>Al-Baqarah</h4>
            <h1>سُورَةُ ٱلْفَاتِحَةِ</h1>

            <div className="card-wrap">
                <div className="card">
                    <h5>1:1</h5>
                    <h1>بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ <span>1</span></h1>
                    <h3>1.Алиф Лом Мим. (Қуръони Каримнинг йигирма тўққиз сураси ҳарфлар билан бошланган. Бу ҳарфларга турлича номлар берилган: баъзилар "Ҳурифул муқатаот" кесик ҳарфлар десалар, бошқалар "Ҳурифул ҳижои" алифбо ҳарифлари дейдилар, учинчилари эса, "Фавотуҳус суар" сураларни очувчилар дейдилар. Бу ҳарфларга турлича ном берилганидек, улар ила бошланишидан кўзланган мурод ҳақида ҳам ҳар хил фикрлар айтилган. Бу ҳақда махсус баҳслар ҳам бор. Баъзи уламолар бу ҳарфларнинг сирини Аллоҳга ҳавола этадилар, бошқалари: "Бу Аллоҳ билан Пайғамбар алайҳиссалом ўрталаридаги сир", дейдилар. Бошқа бирлари эса, уларга ўзларича маъно йўйганлар. Ихтилофнинг асосий сабаби-улар ҳақида на Пайғамбар алайҳиссаломнинг ўзларидан ва на саҳобаи киромлардан бирорта ҳам ривоят йўқлигидир.)</h3>

                    <button><i class="fa-solid fa-volume-high"></i> Play Audio</button>
                </div>

                <div className="card">
                    <h5>1:1</h5>
                    <h1>ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ <span>1</span></h1>
                    <h3>1.Алиф Лом Мим. (Қуръони Каримнинг йигирма тўққиз сураси ҳарфлар билан бошланган. Бу ҳарфларга турлича номлар берилган: баъзилар "Ҳурифул муқатаот" кесик ҳарфлар десалар, бошқалар "Ҳурифул ҳижои" алифбо ҳарифлари дейдилар, учинчилари эса, "Фавотуҳус суар" сураларни очувчилар дейдилар. Бу ҳарфларга турлича ном берилганидек, улар ила бошланишидан кўзланган мурод ҳақида ҳам ҳар хил фикрлар айтилган. Бу ҳақда махсус баҳслар ҳам бор. Баъзи уламолар бу ҳарфларнинг сирини Аллоҳга ҳавола этадилар, бошқалари: "Бу Аллоҳ билан Пайғамбар алайҳиссалом ўрталаридаги сир", дейдилар. Бошқа бирлари эса, уларга ўзларича маъно йўйганлар. Ихтилофнинг асосий сабаби-улар ҳақида на Пайғамбар алайҳиссаломнинг ўзларидан ва на саҳобаи киромлардан бирорта ҳам ривоят йўқлигидир.)</h3>

                    <button><i class="fa-solid fa-volume-high"></i> Play Audio</button>
                </div>
            </div>
        </div>
    </>
  )
}

export default Surah